app/controllers/charges_controller.rb

  def create
    customer = Stripe::Customer.create(
     email: current_user.email,
     card: params[:stripeToken]
   )

   charge = Stripe::Charge.create(
     customer: customer.id,
     amount: 15_00,
     description: "Premium Membership - #{current_user.email}",
     currency: 'usd'
   )

   current_user.update_attributes(role: 'premium')
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 2], ["updated_at", "2017-09-02 00:38:25.317817"], ["id", 22]]

  def destroy
    current_user.update_attributes(role: 'standard')
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2017-09-03 02:25:34.160695"], ["id", 22]]